In [2]:
import pandas as pd
google=pd.read_csv("dataframe_example.csv")
google

      Name   Subject  credits  Marks
0    rajat      math     12.0   78.0
1     ajay   science     10.0    NaN
2   mukesh      math      8.0   54.0
3    rahul   science      9.0   89.0
4   shobna  computer      NaN   76.0
5     aman  computer      5.0   54.0
6      raj   economy      6.0   32.0
7   rajesh   economy     15.0   12.0
8  shubham       bio      2.0    9.0
9    pyush      math      7.0   92.0

In [3]:
google["Marks"]+50

0    128.0
1      NaN
2    104.0
3    139.0
4    126.0
5    104.0
6     82.0
7     62.0
8     59.0
9    142.0
Name: Marks, dtype: float64

In [4]:
google["Marks"].add(50)

0    128.0
1      NaN
2    104.0
3    139.0
4    126.0
5    104.0
6     82.0
7     62.0
8     59.0
9    142.0
Name: Marks, dtype: float64

In [5]:
google["credits"].sub(50)

0   -38.0
1   -40.0
2   -42.0
3   -41.0
4     NaN
5   -45.0
6   -44.0
7   -35.0
8   -48.0
9   -43.0
Name: credits, dtype: float64

In [6]:
google["credits"]-50

0   -38.0
1   -40.0
2   -42.0
3   -41.0
4     NaN
5   -45.0
6   -44.0
7   -35.0
8   -48.0
9   -43.0
Name: credits, dtype: float64

In [8]:
google["credits"]*9
google["credits"]*9

0    108.0
1     90.0
2     72.0
3     81.0
4      NaN
5     45.0
6     54.0
7    135.0
8     18.0
9     63.0
Name: credits, dtype: float64

In [11]:
google["Total Marks"]=google["Marks"]*10
google

      Name   Subject  credits  Marks  Total Marks
0    rajat      math     12.0   78.0        780.0
1     ajay   science     10.0    NaN          NaN
2   mukesh      math      8.0   54.0        540.0
3    rahul   science      9.0   89.0        890.0
4   shobna  computer      NaN   76.0        760.0
5     aman  computer      5.0   54.0        540.0
6      raj   economy      6.0   32.0        320.0
7   rajesh   economy     15.0   12.0        120.0
8  shubham       bio      2.0    9.0         90.0
9    pyush      math      7.0   92.0        920.0